{"inkVersion":21,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"INDEX":["^TheFork0","\n","^MysteriousHole","\n","^TravelingMerchant","\n","^WorstMoment","\n","^Cows","\n","^AbandonedVillage","\n","^DemonSummon","\n","^Thievery","\n","^Sorcerer","\n","^Vampire0","\n","^HiddenMessage0","\n","^TheStranger0","\n","^GoodDeed","\n","^MarketCrowd","\n","^MarketSadness","\n","^Samples","\n","^VendorMob","\n","^Hungry","\n","^AlleywayAmbush","\n","^PillagedVillage","\n","^RockSurprise","\n","^DrunkenDispute0","\n","^TheChampionship0","\n","^NiceDay","\n","^Slimed","\n","^Trip","\n","^Ants","\n","^Overslept","\n","^Stargaze","\n","^DozedOff","\n","^Scared","\n","^AncientWeapon","\n","^Stuck","\n","^Bracelet","\n","^Fountain","\n","^Pickpocketed","\n","^Raccoon","\n","^Snooze","\n","^Temple","\n","^OvergrownTree","\n","^RansackedCamp","\n","^Downpour","\n","end",{"#f":1}],"TravelingMerchant":["#","^title:A Traveling Merchant","/#","#","^time:day","/#","#","^location:road","/#","^…Oho? What’s this! A traveling merchant! A whimsical little guy as well! A short man with a massive beard and the aura of a jester hops up to you. He is offering a sample potion! For free! He grumbles when he realized you are too poor for to buy a full potion. The silly guy tries to sneak off with the sample but it’s too late, it’s already been offered. He slinks away sadly.","\n","^Gain [Jester's Sample]: /+1 to chosen stat for next battle, applies to one player.","\n","end",{"#f":1}],"GoodDeed":[["#","^title:Good Deeds","/#","#","^time:day","/#","#","^location:market","/#","^…You continue on your travels, zoning out until a lady stumbles in front of you. She hurries away, but you see that she’s dropped her coin pouch.","\n","ev","str","^Take it","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Chase after her","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ","\n","^You use it to buy some food.","\n","^/+2 health","\n","end",{"#f":5}],"c-1":["^ ","\n","^You hand back her money, but she accuses you of stealing it. After she finishes yelling up a storm, she scowls, spins on her heels and walks off in a huff. No good deed goes unpunished it seems.","\n","end",{"#f":5}]}],{"#f":1}],"Slimed":["#","^title:Slimed","/#","#","^time:day","/#","#","^location:any","/#","^Something slimy drips onto you. You look around to try and find the source…","\n","^+gross","\n","end",{"#f":1}],"Fountain":[["#","^title:A Miracle","/#","#","^time:day","/#","#","^location:road, forest","/#","^You take a step forward and fall right through the ground.","\n","ev","str","^A trap?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Lucky for you, you just happened to fall into the fountain of youth. The riches you will receive for discovering this. You wonder what you will spend it on.","\n","^Replenish all health","\n","end",{"#f":5}]}],{"#f":1}],"Pickpocketed":[["#","^title:Remember?","/#","#","^time:day","/#","#","^location:road, market","/#","^You think you were pickpocketed last night, the nerve. Someone will pay for this. But for now, you must find out what was stolen.","\n","ev","str","^Check your bag","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Try to remember","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ You shuffle through your bag, throwing everything on to the ground. All of your possessions seems to be accounted for? Unbeknownst to you, one of your relics rolled away while you were busy making a mess.  ","\n","^Choose one card to permanently discard","\n","end",{"#f":5}],"c-1":["^ You try your best to recall everything that led up to the pickpocketing, but all you end up thinking about is how stressful life has been recently.","\n","^Depressing... But you manage remember that you weren't actually pickpocketed.","\n","end",{"#f":5}]}],{"#f":1}],"NiceDay":["#","^title:Nice Day","/#","#","^time:day","/#","#","^location:any","/#","^What a nice day today. You feel strangely happy. You’re excited by what’s to come.","\n","^+2 health","\n","end",{"#f":1}],"Trip":[["#","^title:Worst Mistake","/#","#","^time:day","/#","#","^location:any","/#","^You trip and fall.","\n","^+embarrassment","\n",["^1 health","\n","end",{"#f":5,"#n":"g-0"}],null],{"#f":1}],"Overslept":["#","^title:Sleepy","/#","#","^time:day","/#","#","^location:any","/#","^Sunlight pours into your eyes as you awaken. You’ve overslept! It’s noon already? You hurry up and get ready, your party definitely won’t be happy about this. You hurry on with your adventure…","\n","^+late","\n","end",{"#f":1}],"Ants":["#","^title:Ants in a Line","/#","#","^time:day","/#","#","^location:any","/#","^…You get distracted. Where were you? What? You are too focused on watching a line of ants crawl towards a crumb.","\n","end",{"#f":1}],"MarketCrowd":["#","^title:Market Chaos","/#","#","^time:day","/#","#","^location:market","/#","^The marketplace is becoming hectic yet again. Someone bumps into you. You turn around and they are lost amongst the crowd.","\n","^Choose one card to permanently discard","\n","end",{"#f":1}],"MarketSadness":["#","^title:Retail Sadness","/#","#","^time:day","/#","#","^location:market","/#","^You find yourself browsing in the marketplace for things you cannot afford. What pretty scarves, what delicious fruits. You head back towards the wilderness, away from the warmth of the stalls…","\n","^+sad","\n","end",{"#f":1}],"Samples":[["#","^title:Samples Galore","/#","#","^time:day","/#","#","^location:market","/#","^You continue on your walk when suddenly you remember. There is a festival being held at the marketplace today. You know what that means— free food! Not really, most is paid, but you can steal the free samples!","\n","ev","str","^You head to the buzzing festival","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ Oh boy do you have a feast! You try drinks from all over, snacks from across the world! You sing and dance with your friends all throughout the night.","\n","^+5 health","\n","end",{"#f":5}]}],{"#f":1}],"WorstMoment":[["#","^title:Laughing Stock","/#","#","^time:day","/#","#","^location:road","/#","^Walking up the steps of an old pathway, you trip and roll all the way down to the bottom of the hill. A group of children laughs as you try to brush it off...","\n","^+shattered confidence","\n",["^1 health","\n","end",{"#f":5,"#n":"g-0"}],null],{"#f":1}],"Cows":["#","^title:The Countryside","/#","#","^time:day","/#","#","^location:road","/#","^You pass by a small hut with clothes hanging outside to dry. There's a few cows grazing in the pasture behind.","\n","^+aww","\n","end",{"#f":1}],"VendorMob":["#","^title:Flash Sale","/#","#","^time:day","/#","#","^location:market","/#","^A nearby vendor yells for your attention and shows you what seems to be a free snack sample. You take one step, and suddenly, you're mobbed by merchants in every direction! In-between informing all of them that you're completely broke, you manage to sneak a few samples in your mouth.","\n","^+1 health","\n","^Best to leave before a thief comes along...","\n","end",{"#f":1}],"Raccoon":[["#","^title:A Good Morning","/#","#","^time:day","/#","#","^location:road, forest","/#","^Something is rustling outside. Who’s there? Something claws at your tent. It wants to be let in.","\n","ev","str","^Take a peek outside","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Hide","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ You scan your surroundings but you see nothing. Until you look down. A mere raccoon with its beady eyes looks up at you. You give it a little pet and a treat and send it on its way.","\n","end",{"#f":5}],"c-1":["^ Coward. You wait, frozen in fear. The creature eventually stops. It seems to have left for now, you are safe.","\n","^You check for lost or broken items and continue about your day…","\n","end",{"#f":5}]}],{"#f":1}],"Snooze":["#","^title:Quick Snooze","/#","#","^time:day","/#","#","^location:road, forest","/#","^You know what? You’re too tired for this. You can go back here tomorrow. You want sleep. You head back to camp and snooze.","\n","^+1 health","\n","end",{"#f":1}],"AbandonedVillage":["#","^title:Downpour","/#","#","^time:day","/#","#","^location:road","/#","^It pours outside, you hurry to find shelter from the rain. You head to the nearest village and knock on every door you see, begging to be let in. No one responds. After what feels like a lifetime of this, you remember that this village has been long abandoned. The doors aren’t locked.","\n","^+soaked","\n","end",{"#f":1}],"Stargaze":["#","^title:Stargazer","/#","#","^time:night","/#","#","^location:any","/#","^You pause and admire the stars. It's nice to take a break every once in a while.","\n","^+1 health","\n","end",{"#f":1}],"Scared":["#","^title:A Crow","/#","#","^time:day","/#","#","^location:forest","/#","^It is eerily silent. A crow in the distance caws. You jump from the noise. All your other party members laugh at you.","\n","^+shame +cowardly","\n","^You clear your throat and try your best to continue on…","\n","end",{"#f":1}],"Temple":["#","^title:A Temple","/#","#","^time:day","/#","#","^location:forest, road","/#","^You stumble across an abandoned temple. Opening the door, you find a lone monster dancing a jig. Upon seeing you, it quickly grabs it's weapon and stands guard. There is no getting past it without a fight.","\n","^[fight an enemy]","\n","end",{"#f":1}],"Hungry":[["#","^title:Desperate Measures","/#","#","^time:day","/#","#","^location:market","/#","^You see the bustling marketplace in the distance. Your camp supplies are running low, so you take a look. An uncanny looking owner beckons you over to his stall, where he sells a wide assortment of foods from all over. Your stomach grumbles. Your wallet stresses. You then notice the price… \"$500\", thats $500 more than you have.","\n","ev","str","^Steal the food","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Leave","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Bad move, the storeowner… melts? The marketplace is immediately thrown into chaos the once human rebuilds into a cursed creature. You’ve angered it.","\n","^[fight an enemy] +5 health upon victory","\n","^Gain [food]: +1 health for next battle.","\n","end",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^ The storeowner’s face falls. Almost literally, but it seems you must remain hungry another day.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^morale +hungry","\n","end",{"#f":5}]}],{"#f":1}],"OvergrownTree":[["#","^title:The Tree","/#","#","^time:day","/#","#","^location:road, forest","/#","^You step under an overgrown tree for a quick break. As your eyes start to close, you notice the shadows swirling oddly. You roll out of pure instinct. The grass where you laid mere moments ago lays the claws of a furious monster. It's oddly defensive about this tree.","\n","ev","str","^Fight it","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Leave it alone","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Empowered by some strange force, this monster appears much stronger than you thought it was. ","\n","^[fight an enemy] +2 attack for the enemy","\n","^From its corpse you spot a little branch sticking out. Maybe this was what was making it stronger.","\n","^Gain [Twisted Branch]: +2 attack and -1 health for the next two encounters.","\n","end",{"#f":5}],"c-1":["^ Best not to be a rude guest.","\n","end",{"#f":5}]}],{"#f":1}],"AlleywayAmbush":[["#","^title:Cloaked Figure","/#","#","^time:day","/#","#","^location:market","/#","^You take a peek down a random alleyway and spot a cloaked figure. It gestures for you to come closer.","\n","ev","str","^Go towards it","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ignore it","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ As you walk fully into the shadows, the figure throws it's cloak into the ground, revealing a monster!","\n","^[fight an enemy]","\n","end",{"#f":5}],"c-1":["^ You try to ignore the weirdo in the alleyway until moments later when something strikes you leg, hard. You turn around and see it's the same thing from before, only now fully revealed in the daylight!","\n","^[fight an enemy] with -1 speed and health for the active player","\n","end",{"#f":5}]}],{"#f":1}],"RansackedCamp":["#","^title:Ransacked","/#","#","^time:day","/#","#","^location:forest, road","/#","^You decide to head back to camp, only to find it’s been completely ransacked? Who- no, what did this? This isn’t the work of another person, the claw marks left on the last shreds of your tents tell you that much. You hope it’s just a raccoon. Or something equally as measly. It is not.","\n","^[fight an enemy]","\n","end",{"#f":1}],"PillagedVillage":[["#","^title:Heroic Entrance","/#","#","^time:day","/#","#","^location:market","/#","^You are stopped in your path when you hear screaming in the distance. Out of curiosity, you take a look. Pushing through the running crowds, you are faced with several monsters pillaging the village. Villagers beg for your help.","\n","ev","str","^Help","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Leave","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ You ready your weapon. One of the creatures turn to face you and laugh.","\n","^[fight an enemy]","\n","^The remaining monsters run away in fear. The villagers thank you, and give you the little they have left.","\n","^Gain [old charm]: -1 to all enemy stats for one encounter.","\n","end",{"#f":5}],"c-1":["^ Not your problem. The villagers cry in despair.","\n","end",{"#f":5}]}],{"#f":1}],"Downpour":["#","^title:The odds","/#","#","^time:day","/#","#","^location:road, forest","/#","^It starts to rain as you walk. Then it starts to pour. In front of you lays a skeleton, and you start to picture how cool it would look if it was struck by lightning. Lightning immediately hits it. Instead of the fried corpse you thought would remain, the lightning has reanimated it. The creature crawls towards you.","\n","^[fight an enemy]","\n","end",{"#f":1}],"DozedOff":["#","^title:Life-saving sportsmanship","/#","#","^time:day","/#","#","^location:any","/#","^You startle awake when you feel something tap you. You’ve dozed off mid battle, yet your opponent has waited patiently while you slept. Time to finish this.","\n","^+1 health","\n","^[fight an enemy]","\n","^You, proud and victorious, walk off prepared to face anything...","\n","^+ego","\n","end",{"#f":1}],"RockSurprise":[["#","^title:Challenger","/#","#","^time:day","/#","#","^location:market","/#","^\"Watch Out!\" you hear somebody yell. You turn around as fast as you can before a rock hits you square in the nose. The villager, who you assume was the one that gave you the warning, points towards an furious monster.","\n",["^1 health","\n","^[fight an Enemy]","\n","end",{"#f":5,"#n":"g-0"}],null],{"#f":1}],"DemonSummon":["#","^title:Visitor","/#","#","^time:day","/#","#","^location:road","/#","^You waltz on without a care into a small town. The town has been friendly and inviting, offering you food and shelter. Still, your instincts tell you to be wary. You see no reason to fear them, but your gut is rarely wrong. You decide to slip into the towns church to investigate. Muffled chanting comes from the back room. With a sudden flash of blood red light, you are faced with a monster. What demon has this cult summoned?","\n","^[fight an enemy]","\n","^The once welcoming town has become hostile. They don’t like when outsiders meddle with their business. You get kicked back out into the wild.","\n","end",{"#f":1}],"Thievery":["#","^title:Dirt Road Robbery","/#","#","^time:day","/#","#","^location:road","/#","^You continue to trudge on. It’s getting late. But there! In the distance! You spot a camp! Someone else’s, but you don’t see anyone there. The campers must’ve left for a bit, but they’ll probably be back soon. So what do you do? Loot them, obviously.","\n","^+[Thief’s Dagger]: once every encounter, sneak attack and negate defense.","\n","end",{"#f":1}],"AncientWeapon":[["#","^title:Ancient Opportunity","/#","#","^time:day","/#","#","^location:forest","/#","^You see an ancient weapon. It seems heavily guarded. You worry about traps.","\n","ev","str","^Take it","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Leave it","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Gain [Sharpened arrow]: +1 attack.","\n","^-2 health for active player","\n","end",{"#f":5}],"c-1":["^ It probably wasn't worth it anyways","\n","end",{"#f":5}]}],{"#f":1}],"Stuck":["#","^title:Stuck","/#","#","^time:day","/#","#","^location:forest","/#","^You find a cave tight enough to give the most courageous soul crippling claustrophobia. You, not out of bravery but rather out of unintelligence, decide to squeeze in because you see something shiny. You are lucky that your party members are there to pull you out when you get stuck.","\n","^+[Shiny Gem]: Heal one player by 3 health once every battle.","\n","end",{"#f":1}],"Bracelet":["#","^title:Looter","/#","#","^time:day","/#","#","^location:forest, road","/#","^Pebbles crunch beneath your feet as you trudge through the ruins. There is a hand sticking out the center of a destroyed building. It holds a bracelet with protective runes etched on its beads. How ironic.","\n","^Gain [Bracelet of Protection?]: -1 health, +1 defense every round","\n","end",{"#f":1}],"Sorcerer":[["#","^title:The Oracle","/#","#","^time:day","/#","#","^location:road","/#","^You get suddenly snatched into a tent while passing through a small town!  An old, towering sorcerer leans over you and grabs your hands. \"\"Have my orb,\"\" she says, after inspecting your palms, \"it'll be more of use for you than me.\"","\n","ev","str","^Accept","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Refuse","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Gain [Orb of Sacrifices]: At any point, players can choose to transfer 2 points of health into the orb. On it's use, the Orb deals +1 damage for each transfer. Exploding into fine shards, it cannot be used again.","\n","end",{"#f":5}],"c-1":["^ She whispers into your ear, \"you won't be alive long enough to use it anyways,\" before kicking you out.","\n","end",{"#f":5}]}],{"#f":1}],"Vampire0":[["#","^title:Vampire's Dilemma","/#","#","^time:day","/#","#","^location:road","/#","^The sun is setting. There is a barn nearby and not a human in sight, A cow couldn't be that bad of a roommate, so you head in. To your surprise, someone is already there. Pale as a ghost, with teeth sharp as knives, it's a vampire! But you are safe, for this one declares himself a vegan! Or so you thought. \"Humans don't count!\" the vampire says. He then lunges to bite you.","\n","ev","str","^Let him bite you","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Kill him","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ The poor thing looks so starved. You somehow pity him.","\n","^-self preservation skills -1 health for one player","\n","end",{"#f":5}],"c-1":["^ You just happen to have a wooden stake for this exact moment.","\n","end",{"#f":5}]}],{"#f":1}],"DrunkenDispute0":[["#","^title:Drunken Dispute","/#","#","^time:day","/#","#","^location:market","/#","^Your journey has been disrupted. Annoying bickering pierces your ears. What a pain. Following the sounds in hopes you can get them to shut up, you reach a tavern, one that will empty soon no doubt. Inside, a drunk man is arguing with a bartender. \"It was.. nasty!! A s-scam!!\" He slurs his words. The bartender looks at him with condescending, yet pitying eyes. \"The 12 prior orders suggest otherwise.\" The drunken man angers, demanding a refund. You notice his cup is still full.","\n","ev","str","^Side with the drunk man","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Side with the bartender","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Despite his tantrum, he barely touched his drink. Normal stores would offer a refund.","\n","^Plus, that bartender seems pretentious. You don't like him.","\n","end",{"#f":5}],"c-1":["^ What an annoying customer, this is practically harassment. He should be kicked out, it is not difficult to do as all his punches miss.","\n","end",{"#f":5}]}],{"#f":1}],"HiddenMessage0":["#","^title:Hidden Message","/#","#","^time:day","/#","#","^location:road, forest","/#","^You decide to visit the riverbank beside your camp. You find that it has become your safe haven whenever you need a moment of calm. Birds sing above you. Waves ripple below you. Dipping your feet into the cool water, you feel something lightly tap you from below the current. Looking down, you notice a small bottle. Littering? Someone wasn't taught manners. You pop open the cork and look inside. A tiny scroll sits in the bottom. Unraveling it reveals a hastily scribbled note. Whoever wrote this was in a rush. Or has bad handwriting. It reads  \"... ends ... the ... end\". How cryptic. The shadow in the corner of your eye has disappeared.","\n","^Gain [message in a bottle] - You do not know what this means, yet.","\n","end",{"#f":1}],"TheFork0":[["#","^title:Fork in the Road","/#","#","^time:day","/#","#","^location:road","/#","^There's a fork in the road, with no indication of which path leads to where. You scan the horizon for any possible information, but the paths disappear inside two forests on opposite sides of the valley.","\n","^However, you do spot that the forest on the right is oddly shrouded in darkness, while the one on the left is somehow glowing.","\n","ev","str","^Light Path","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Dark Path","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^Your compass spins wildly as you step inside the glowing forest. As you get deeper in, the trees around you become brighter and brighter until you can barely keep your eyes open. Suddenly, everything goes dark. You feel around for a few minutes, making sure your life isn't in danger, before sprinting down the path until you emerge out into the open plains again.","\n","end",{"#f":5}],"c-1":["\n","^Nothing eventful happens despite the ominous appearance of the forest. However, you do get the sense here and there that something is following you.","\n","end",{"#f":5}]}],{"#f":1}],"TheStranger0":["#","^title:The Stranger","/#","#","^time:day","/#","#","^location:road","/#","^You're resting in a peaceful small town when you hear a loud bang right down the street. Still being on break, you try to shift your attention back to the drink in your hand. Your travels have been so hard after all. And unfortunately, it's not about to get easier. Your drink shatters into a million pieces when you hear another loud bang right next to your head.","\n","^\"En garde, degenerate!\" A crazy person shoves their face right up to yours. Blue hair fills your vision. You shove them back out of instinct, but they dash away to bother someone else before you get to curse them out.","\n","end",{"#f":1}],"TheChampionship0":["#","^title:The Championship?","/#","#","^time:day","/#","#","^location:market","/#","^As you browse the market of things you can't afford, a voice startles you. “Come on friend, buddy, bestie, $2 is insane!” The price tag says $100, so this guy seems to have wrangled a 98% discount. Being nosey, you head over. By the look of the man, it would’ve been easier for him to steal the food, but his negotiation skills are impressive. A tiny baby chick sits comfortably in the nook of his neck. He jumps when he sees you, scaring the bird. The necklace he wears is a magical one, and definitely powerful. Strange. “Pal! Help me out here?” Despite your empty pockets, his face still lights up. He rushes to pull out a crumpled flyer from his pocket and proudly displays it to you. It’s an ad for a tournament. The reward is $1 million— you almost faint at the sum. “You seem tough! This could help!” He beams. Seems like he’s forgotten about the stall. You snag the flyer and walk off. “Wha- my flyer! Where are you going? Can I come?” His voice fades into the distance as you drool over the reward. Still, your mood is somehow lightened. Continuing on...","\n","end",{"#f":1}],"MysteriousHole":[["#","^title:Mysterious Hole","/#","#","^time:day","/#","#","^location:road","/#","^You come across a large hole in the middle of your path. It's deep enough that you can't tell exactly where the bottom is, even on a cloudless day. You remember hearing a trick about dropping a coin to determine how deep something is. Being broke, you find a nearby pebble and chuck it down...","\n","^After a long, long time of waiting for a sound from the bottom, you spot the same rock rapidly flying up directly towards you.","\n","ev","str","^Catch!","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Gain [Magnetic Pebble]: Usable in one encounter, deals 1 damage.","\n","^You skirt around the hole...","\n","end",{"#f":5}]}],{"#f":1}],"Act1End":["#","^title:The End of Act I","/#","^Music blares, crowds roar. You seem to have come across a large event. In front of you sits a massive colosseum, it's a wonder how you missed that. You were probably too busy staring at the $1 million reward posted on the flyer for this tournament. This is your way in, the key. \"You're here too!\" A tall man towers behind you with a cheery smile. Your eye catches on his glowing necklace. You feel as if you recognize the necklace. And him too, but the necklace is more interesting. The small chick that sits on his shoulder chirps in recognition, it almost escaped your notice. Ah well, they must not be important if you forgot. The problem is that he seems to remember you. \"We never exchanged names!” Thank the gods. “I'm Artho!” The bird, who has now moved to the top of his head, chirps in anger of being ignored. “-and this is Pip! It's a pleasure to see you again :)\" Despite the registration being full, Artho somehow still manages to weasel you in. The man is kind to you, you probably saved him at one point or something. Fighting all these monsters, everything blurs together. He leads you into the colosseum, showing you around, but the only thing on your mind is the reward still echoing in your head. Don't lose your focus, heroes, you still have ways to go.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}